Tekla.Structures.ModelInternal.CylindricalSurface
The CylindricalSurface class defines a cylindrical surface contour.

Tekla.Structures.ModelInternal.CylindricalSurface.#ctor(System.Double,System.Double,System.Boolean,Tekla.Structures.Geometry3d.Line,Tekla.Structures.Geometry3d.LineSegment,Tekla.Structures.Geometry3d.LineSegment)
Instantiates a cylindrical surface with given parameters.
radius: The radius.
maxRadius: The maximum radius for inward curve, minimum radius for outward curve.
inwardCurved: true if the curve is oriented towards the intersection line, false otherwise.
intersectionLine: The intersection line.
lateralBoundary1: The first lateral boundary.
lateralBoundary2: The second lateral boundary.

Tekla.Structures.ModelInternal.CylindricalSurface.Radius
Radius of curved surface.

Tekla.Structures.ModelInternal.CylindricalSurface.MaxRadius
The maximum radius for inward curve, minimum radius for outward curve.

Tekla.Structures.ModelInternal.CylindricalSurface.InwardCurved
Direction of the curve - true if the curve is oriented towards the intersection line, false otherwise.

Tekla.Structures.ModelInternal.CylindricalSurface.IntersectionLine
Intersection line.

Tekla.Structures.ModelInternal.CylindricalSurface.LateralBoundary1
The first lateral boundary.

Tekla.Structures.ModelInternal.CylindricalSurface.LateralBoundary2
The second lateral boundary.